Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 "fsb_pvb_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, pod_volume_backup)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                    ]
                }
              + time                 = {
                  + from = "now-2d"
                  + to   = "now"
                }
              + timepicker           = {
                  + hidden            = false
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                }
              + timezone             = ""
              + title                = "Kubernetes/Tanzu/Velero"
              + uid                  = "YAniUGC"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + overwrite    = true
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/1password-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/1password-scimbridge.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/aws-backup-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/aws-cni-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/aws-subnet-usage.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/blueprints-rds-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/cloud-engineering-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/cluster-capacity.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/cluster-health.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/ec2-credits.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/eks-version.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/flux-cluster-stats.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/flux-control-plane.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/goldpinger.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/helm-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/kafka-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/kiosk.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/kubernetes-components.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/liveness-readiness-for-namespace.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/liveness-readiness.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/node-condition.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/node-sockets-used.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/priorityclass.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/prometheus-blackbox-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/selfservice-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/selfservice-rds-tagging-compliance.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/traefik-blue-green.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/traefik-integration.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards[0].grafana_dashboard_permission.this["dashboards/velero.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:ddfcp482rkiyoe" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "1password"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-1Password" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "ddfcp482rkiyoe" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:cdj0a5m7tqtc0a" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "awsbackupobservability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://aws-backup-dashboards/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-AWS-Backup" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "cdj0a5m7tqtc0a" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrbwyhrnpm9sb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              - authType       = "grafana_assume_role"
              - catalog        = "iam-rolesanywhere-pca-observability"
              - database       = "iam_rolesanywhere_pca_observability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              - workgroup      = "iam-rolesanywhere-pca-observability"
            }
        ) -> null
      - name               = "Athena-IAM-roles-anywhere" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "edrbwyhrnpm9sb" -> null
    }

  # module.grafana_data_source_aws_athena[0].grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "1password"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-1Password"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena[0].grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "awsbackupobservability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://aws-backup-dashboards/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-AWS-Backup"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena[0].grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              + authType       = "grafana_assume_role"
              + catalog        = "iam-rolesanywhere-pca-observability"
              + database       = "iam_rolesanywhere_pca_observability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              + workgroup      = "iam-rolesanywhere-pca-observability"
            }
        )
      + name               = "Athena-IAM-roles-anywhere"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:fdrtfy9dhcm4gd" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "fdrtfy9dhcm4gd" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrtfy9d4v4e8e" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "edrtfy9d4v4e8e" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:fdey90cd04a2oa" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-west-1"
            }
        ) -> null
      - name               = "CloudWatch-oxygen-eu-west-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "fdey90cd04a2oa" -> null
    }

  # module.grafana_data_source_aws_cloudwatch[0].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch[0].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch[0].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-west-1"
            }
        )
      + name               = "CloudWatch-oxygen-eu-west-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_notification.grafana_contact_point.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_contact_point" "this" {
      - disable_provenance = false -> null
      - id                 = "0:Cloud Engineering Slack" -> null
      - name               = "Cloud Engineering Slack" -> null
      - org_id             = "0" -> null

      - slack {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.grafana_notification.grafana_notification_policy.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_notification_policy" "this" {
      - contact_point      = "grafana-default-email" -> null
      - disable_provenance = true -> null
      - group_by           = [
          - "...",
        ] -> null
      - group_interval     = "5m" -> null
      - group_wait         = "30s" -> null
      - id                 = "0:policy" -> null
      - org_id             = "0" -> null
      - repeat_interval    = "4h" -> null

      - policy {
          - contact_point = "Cloud Engineering Slack" -> null
          - continue      = false -> null
          - group_by      = [
              - "grafana_folder",
            ] -> null
          - mute_timings  = [] -> null

          - matcher {
              - label = "grafana_folder" -> null
              - match = "=" -> null
              - value = "Cloud Engineering" -> null
            }

          - policy {
              - continue        = false -> null
              - group_by        = [
                  - "grafana_folder",
                  - "alertname",
                ] -> null
              - mute_timings    = [] -> null
              - repeat_interval = "1d" -> null

              - matcher {
                  - label = "repeat" -> null
                  - match = "=" -> null
                  - value = "24h" -> null
                }
            }
        }
    }

  # module.grafana_notification[0].grafana_contact_point.this[0] will be created
  + resource "grafana_contact_point" "this" {
      + disable_provenance = false
      + id                 = (known after apply)
      + name               = "Cloud Engineering Slack"

      + slack {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.grafana_notification[0].grafana_notification_policy.this[0] will be created
  + resource "grafana_notification_policy" "this" {
      + contact_point      = "grafana-default-email"
      + disable_provenance = true
      + group_by           = [
          + "...",
        ]
      + group_interval     = "5m"
      + group_wait         = "30s"
      + id                 = (known after apply)
      + repeat_interval    = "4h"

      + policy {
          + contact_point = "Cloud Engineering Slack"
          + group_by      = [
              + "grafana_folder",
            ]

          + matcher {
              + label = "grafana_folder"
              + match = "="
              + value = "Cloud Engineering"
            }

          + policy {
              + group_by        = [
                  + "grafana_folder",
                  + "alertname",
                ]
              + repeat_interval = "24h"

              + matcher {
                  + label = "repeat"
                  + match = "="
                  + value = "24h"
                }
            }
        }
    }

Plan: 98 to add, 0 to change, 98 to destroy.

Changes to Outputs:
  ~ dashboard_meta = [
      ~ {
          ~ uid     = "1password_metrics_adoption" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/1password_metrics_adoption/1password-adoption" -> (known after apply)
          ~ version = 18 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "scimbridge_prod" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/scimbridge_prod/scimbridge-deployment-prod" -> (known after apply)
          ~ version = 6 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "aws_backup_metrics" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/aws_backup_metrics/aws-backup-metrics" -> (known after apply)
          ~ version = 5 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "aws-cni-metrics" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/aws-cni-metrics/aws-cni-metrics" -> (known after apply)
          ~ version = 10 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "1NxY8ypGk" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/1NxY8ypGk/aws-subnet-usage" -> (known after apply)
          ~ version = 4 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "a9c79f60-fdde-4e66-9009-b3863c3e0eda" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/a9c79f60-fdde-4e66-9009-b3863c3e0eda/blueprints-rds-adoption" -> (known after apply)
          ~ version = 4 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "axdphXDZz" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/axdphXDZz/cloud-engineering-adoption" -> (known after apply)
          ~ version = 7 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "s_zMzas4z" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/s_zMzas4z/cluster-capacity" -> (known after apply)
          ~ version = 4 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "4IxKHWtMz" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/4IxKHWtMz/cluster-health" -> (known after apply)
          ~ version = 8 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "GUakfOpMk" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/GUakfOpMk/ec2-credits" -> (known after apply)
          ~ version = 14 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "YMBzktpGzs" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/YMBzktpGzs/eks-version" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "flux-cluster" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/flux-cluster/flux-cluster-stats" -> (known after apply)
          ~ version = 5 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "flux-control-plane" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/flux-control-plane/flux-control-plane" -> (known after apply)
          ~ version = 9 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "D4EyPQTWk" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/D4EyPQTWk/goldpinger" -> (known after apply)
          ~ version = 4 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "Gqncyvfmz" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/Gqncyvfmz/helm-exporter" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "CoYn_3-nk" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/CoYn_3-nk/kafka-exporter" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "b8e019c1-27b7-4e4b-b880-28da9911f046" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/b8e019c1-27b7-4e4b-b880-28da9911f046/kiosk" -> (known after apply)
          ~ version = 10 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "bj5-ZEhWk" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/bj5-ZEhWk/kubernetes-components" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "ca866f47-2789-471f-ae87-72a3e701b68a" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/ca866f47-2789-471f-ae87-72a3e701b68a/readiness-liveness-probes-in-namespace" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "ad9f701f-2796-43d2-bbf9-5ff1002118e9" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/ad9f701f-2796-43d2-bbf9-5ff1002118e9/readiness-liveness-probes" -> (known after apply)
          ~ version = 5 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "KbpocXAVk" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/KbpocXAVk/node-condition" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "GGodmXAVz" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/GGodmXAVz/node-sockets-used" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "W8nct6zGz" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/W8nct6zGz/priority-class" -> (known after apply)
          ~ version = 4 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "bXDq_ZNnz" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/bXDq_ZNnz/prometheus-blackbox-exporter" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "c9f3f4c0-454f-49df-90e3-93a13d25ce4b" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/c9f3f4c0-454f-49df-90e3-93a13d25ce4b/selfservice-tagging-adoption" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "d032a367-82af-425a-8d05-c1e5395aeee3" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/d032a367-82af-425a-8d05-c1e5395aeee3/selfservice-rds-tagging-compliance" -> (known after apply)
          ~ version = 1 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "jGlZuY0Vk" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/jGlZuY0Vk/traefik-blue-green-deployment" -> (known after apply)
          ~ version = 8 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "qPdAviJmz" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/qPdAviJmz/traefik" -> (known after apply)
          ~ version = 6 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
      ~ {
          ~ uid     = "YAniUGC" -> (known after apply)
          ~ url     = "https://demo.grafana.dfds.cloud/d/YAniUGC/kubernetes-tanzu-velero" -> (known after apply)
          ~ version = 2 -> (known after apply)
            # (1 unchanged attribute hidden)
        },
    ]

time=2024-08-15T08:49:13Z level=info msg=Downloading Terraform configurations from file:///atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-demo-ws-01 into /atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-demo-ws-01/environments/demo/.terragrunt-cache/pTdoceW9WVTREjI9koq00UcUxhc/0b3YoIT6oNFKtU3MmQIZMgWk5hA
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d environments/demo -w grafana-cloud-objects-demo-ws-01
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.hellman.oxygen.dfds.cloud/lock?id=dfds%252Fgrafana-cloud-objects%252Fenvironments%252Fdemo%252Fgrafana-cloud-objects-demo-ws-01)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d environments/demo -w grafana-cloud-objects-demo-ws-01
  ```
Plan: 98 to add, 0 to change, 98 to destroy.

---
### 3. dir: `environments/platform` workspace: `grafana-cloud-objects-platform-ws-01`
<details><summary>Show Output</summary>

```diff
time=2024-08-15T08:49:17Z level=info msg=Downloading Terraform configurations from file:///atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01 into /atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01/environments/platform/.terragrunt-cache/U54ShdOYLL9xW6-tvbqfARbsodE/9BMdIpBe-O6Z80jvzminapAjLXM

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Upgrading modules...
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for alerts...
- alerts in .terraform/modules/alerts/grafana_alert
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for ce_folder...
- ce_folder in .terraform/modules/ce_folder/grafana_folder
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for dashboards...
- dashboards in .terraform/modules/dashboards/grafana_dashboard
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_athena...
- grafana_data_source_aws_athena in .terraform/modules/grafana_data_source_aws_athena/grafana_data_source_athena
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_cloudwatch...
- grafana_data_source_aws_cloudwatch in .terraform/modules/grafana_data_source_aws_cloudwatch/grafana_data_source_cloudwatch
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_notification...
- grafana_notification in .terraform/modules/grafana_notification/grafana_notification

Initializing provider plugins...
- Finding grafana/grafana versions matching ">= 2.9.0"...
- Finding hashicorp/random versions matching "~> 3.6.0"...
- Finding hashicorp/aws versions matching ">= 5.34.0"...
- Installing grafana/grafana v3.7.0...
- Installed grafana/grafana v3.7.0 (signed, key ID 570AA42029AE241A)
- Installing hashicorp/random v3.6.2...
- Installed hashicorp/random v3.6.2 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/aws v5.62.0...
- Installed hashicorp/aws v5.62.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!

time=2024-08-15T08:49:26Z level=info msg=Downloading Terraform configurations from file:///atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01 into /atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01/environments/platform/.terragrunt-cache/U54ShdOYLL9xW6-tvbqfARbsodE/9BMdIpBe-O6Z80jvzminapAjLXM

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for alerts...
- alerts in .terraform/modules/alerts/grafana_alert
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for ce_folder...
- ce_folder in .terraform/modules/ce_folder/grafana_folder
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for dashboards...
- dashboards in .terraform/modules/dashboards/grafana_dashboard
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_athena...
- grafana_data_source_aws_athena in .terraform/modules/grafana_data_source_aws_athena/grafana_data_source_athena
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_cloudwatch...
- grafana_data_source_aws_cloudwatch in .terraform/modules/grafana_data_source_aws_cloudwatch/grafana_data_source_cloudwatch
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_notification...
- grafana_notification in .terraform/modules/grafana_notification/grafana_notification

Initializing provider plugins...
- Reusing previous version of grafana/grafana from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing grafana/grafana v3.7.0...
- Installed grafana/grafana v3.7.0 (signed, key ID 570AA42029AE241A)
- Installing hashicorp/random v3.6.2...
- Installed hashicorp/random v3.6.2 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/aws v5.62.0...
- Installed hashicorp/aws v5.62.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!
module.ce_folder.random_uuid.this: Refreshing state... [id=c3fd8820-e5b7-d60f-de99-4d1231726eed]
data.aws_ssm_parameter.grafana_sa_access_token: Reading...
data.aws_ssm_parameter.grafana_url: Reading...
data.aws_ssm_parameter.grafana_url: Read complete after 0s [id=/grafana-cloud/dfdsplatformservices/stack-url]
data.aws_ssm_parameter.grafana_sa_access_token: Read complete after 0s [id=/grafana-cloud/dfdsplatformservices/terraform-sa-access-token]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"]: Refreshing state... [id=1:adrtfydetni0wb]
module.ce_folder.grafana_folder.this: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"]: Refreshing state... [id=1:edp232mk1y58gc]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"]: Refreshing state... [id=1:edrtfydh1oagwb]
module.grafana_notification.grafana_contact_point.this[0]: Refreshing state... [id=0:Cloud Engineering Slack]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"]: Refreshing state... [id=1:ddor6qshlvgu8d]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"]: Refreshing state... [id=1:ddp232mqi6pdsb]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"]: Refreshing state... [id=1:edrbwxzugq7eob]
module.dashboards.grafana_dashboard.this["dashboards/node-sockets-used.json"]: Refreshing state... [id=0:GGodmXAVz]
module.dashboards.grafana_dashboard.this["dashboards/flux-cluster-stats.json"]: Refreshing state... [id=0:flux-cluster]
module.dashboards.grafana_dashboard.this["dashboards/eks-version.json"]: Refreshing state... [id=0:YMBzktpGzs]
module.dashboards.grafana_dashboard.this["dashboards/goldpinger.json"]: Refreshing state... [id=0:D4EyPQTWk]
module.dashboards.grafana_dashboard.this["dashboards/liveness-readiness-for-namespace.json"]: Refreshing state... [id=0:ca866f47-2789-471f-ae87-72a3e701b68a]
module.dashboards.grafana_dashboard.this["dashboards/aws-cni-metrics.json"]: Refreshing state... [id=0:aws-cni-metrics]
module.dashboards.grafana_dashboard.this["dashboards/priorityclass.json"]: Refreshing state... [id=0:W8nct6zGz]
module.dashboards.grafana_dashboard.this["dashboards/1password-scimbridge.json"]: Refreshing state... [id=0:scimbridge_prod]
module.dashboards.grafana_dashboard.this["dashboards/node-condition.json"]: Refreshing state... [id=0:KbpocXAVk]
module.dashboards.grafana_dashboard.this["dashboards/aws-subnet-usage.json"]: Refreshing state... [id=0:1NxY8ypGk]
module.dashboards.grafana_dashboard.this["dashboards/cluster-capacity.json"]: Refreshing state... [id=0:s_zMzas4z]
module.dashboards.grafana_dashboard.this["dashboards/kiosk.json"]: Refreshing state... [id=0:b8e019c1-27b7-4e4b-b880-28da9911f046]
module.dashboards.grafana_dashboard.this["dashboards/kafka-exporter.json"]: Refreshing state... [id=0:CoYn_3-nk]
module.dashboards.grafana_dashboard.this["dashboards/kubernetes-components.json"]: Refreshing state... [id=0:bj5-ZEhWk]
module.dashboards.grafana_dashboard.this["dashboards/traefik-blue-green.json"]: Refreshing state... [id=0:jGlZuY0Vk]
module.dashboards.grafana_dashboard.this["dashboards/helm-exporter.json"]: Refreshing state... [id=0:Gqncyvfmz]
module.dashboards.grafana_dashboard.this["dashboards/selfservice-adoption.json"]: Refreshing state... [id=0:c9f3f4c0-454f-49df-90e3-93a13d25ce4b]
module.dashboards.grafana_dashboard.this["dashboards/selfservice-rds-tagging-compliance.json"]: Refreshing state... [id=0:d032a367-82af-425a-8d05-c1e5395aeee3]
module.dashboards.grafana_dashboard.this["dashboards/traefik-integration.json"]: Refreshing state... [id=0:qPdAviJmz]
module.dashboards.grafana_dashboard.this["dashboards/liveness-readiness.json"]: Refreshing state... [id=0:ad9f701f-2796-43d2-bbf9-5ff1002118e9]
module.dashboards.grafana_dashboard.this["dashboards/velero.json"]: Refreshing state... [id=0:YAniUGC]
module.dashboards.grafana_dashboard.this["dashboards/cluster-health.json"]: Refreshing state... [id=0:4IxKHWtMz]
module.dashboards.grafana_dashboard.this["dashboards/blueprints-rds-adoption.json"]: Refreshing state... [id=0:a9c79f60-fdde-4e66-9009-b3863c3e0eda]
module.dashboards.grafana_dashboard.this["dashboards/flux-control-plane.json"]: Refreshing state... [id=0:flux-control-plane]
module.dashboards.grafana_dashboard.this["dashboards/aws-backup-metrics.json"]: Refreshing state... [id=0:aws_backup_metrics]
module.dashboards.grafana_dashboard.this["dashboards/cloud-engineering-adoption.json"]: Refreshing state... [id=0:axdphXDZz]
module.dashboards.grafana_dashboard.this["dashboards/1password-metrics.json"]: Refreshing state... [id=0:1password_metrics_adoption]
module.dashboards.grafana_dashboard.this["dashboards/prometheus-blackbox-exporter.json"]: Refreshing state... [id=0:bXDq_ZNnz]
module.dashboards.grafana_dashboard.this["dashboards/ec2-credits.json"]: Refreshing state... [id=0:GUakfOpMk]
module.alerts.grafana_rule_group.alertrule["alertrules/Goldpinger.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Goldpinger alert]
module.alerts.grafana_rule_group.alertrule["alertrules/EC2 Worker Node Credit Balance alert.json"]: Refreshing state... [id=1:c3fd8820-e5b7-d60f-de99-4d1231726eed:EC2 Worker Node Credit Balance alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Is cluster version past EOL.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Is cluster version past EOL]
module.alerts.grafana_rule_group.alertrule["alertrules/Failed Restore Counts alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Failed Restore Counts alert]
module.alerts.grafana_rule_group.alertrule["alertrules/CPU Capacity Utilization Alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:CPU Capacity Utilization Alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Fluentd available buffer space ratio alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Fluentd available buffer space ratio alert]
module.alerts.grafana_rule_group.alertrule["alertrules/API server 5xx errors alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:API server 5xx errors alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Version alerts alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Version alerts alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Topic has large amount of consumergroups.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Topic has large amount of consumergroups]
module.alerts.grafana_rule_group.alertrule["alertrules/SSL expiry alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:SSL expiry alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Memory Capacity Utilization Alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Memory Capacity Utilization Alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Priority Classes alert.json"]: Refreshing state... [id=1:c3fd8820-e5b7-d60f-de99-4d1231726eed:Priority Classes alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Misuse of priority classes.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Misuse of priority classes]
module.alerts.grafana_rule_group.alertrule["alertrules/Pod Capacity Utilization Alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Pod Capacity Utilization Alert]
module.alerts.grafana_rule_group.alertrule["alertrules/CoreDNS unavailable alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:CoreDNS unavailable alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Restore Validation Failure alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Restore Validation Failure alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Kafka-exporter up alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Kafka-exporter up alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Backup Validation Failure alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Backup Validation Failure alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Nodes by state alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Nodes by state alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Subnet IP usage alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Subnet IP usage alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Watchdog.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Watchdog]
module.alerts.grafana_rule_group.alertrule["alertrules/Blackbox probe target is down.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Blackbox probe target is down]
module.alerts.grafana_rule_group.alertrule["alertrules/VPC CNI unavailable alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:VPC CNI unavailable alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Volume Snapshot Failure alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Volume Snapshot Failure alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Sockets used per node alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Sockets used per node alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Kube-Proxy unavailable alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Kube-Proxy unavailable alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Components version bump alerts alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Components version bump alerts alert]
module.alerts.grafana_rule_group.alertrule["alertrules/NodeNotReady.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:NodeNotReady]
module.alerts.grafana_rule_group.alertrule["alertrules/Container Restarts (5m) alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Container Restarts (5m) alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Fluentd  daemonset running timeseries alert.json"]: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Fluentd  daemonset running timeseries alert]
module.grafana_notification.grafana_notification_policy.this[0]: Refreshing state... [id=0:policy]
module.dashboards.grafana_dashboard_permission.this["dashboards/traefik-blue-green.json"]: Refreshing state... [id=0:jGlZuY0Vk]
module.dashboards.grafana_dashboard_permission.this["dashboards/eks-version.json"]: Refreshing state... [id=0:YMBzktpGzs]
module.dashboards.grafana_dashboard_permission.this["dashboards/liveness-readiness-for-namespace.json"]: Refreshing state... [id=0:ca866f47-2789-471f-ae87-72a3e701b68a]
module.dashboards.grafana_dashboard_permission.this["dashboards/prometheus-blackbox-exporter.json"]: Refreshing state... [id=0:bXDq_ZNnz]
module.dashboards.grafana_dashboard_permission.this["dashboards/traefik-integration.json"]: Refreshing state... [id=0:qPdAviJmz]
module.dashboards.grafana_dashboard_permission.this["dashboards/liveness-readiness.json"]: Refreshing state... [id=0:ad9f701f-2796-43d2-bbf9-5ff1002118e9]
module.dashboards.grafana_dashboard_permission.this["dashboards/blueprints-rds-adoption.json"]: Refreshing state... [id=0:a9c79f60-fdde-4e66-9009-b3863c3e0eda]
module.dashboards.grafana_dashboard_permission.this["dashboards/flux-cluster-stats.json"]: Refreshing state... [id=0:flux-cluster]
module.dashboards.grafana_dashboard_permission.this["dashboards/node-sockets-used.json"]: Refreshing state... [id=0:GGodmXAVz]
module.dashboards.grafana_dashboard_permission.this["dashboards/selfservice-rds-tagging-compliance.json"]: Refreshing state... [id=0:d032a367-82af-425a-8d05-c1e5395aeee3]
module.dashboards.grafana_dashboard_permission.this["dashboards/aws-backup-metrics.json"]: Refreshing state... [id=0:aws_backup_metrics]
module.dashboards.grafana_dashboard_permission.this["dashboards/aws-cni-metrics.json"]: Refreshing state... [id=0:aws-cni-metrics]
module.dashboards.grafana_dashboard_permission.this["dashboards/priorityclass.json"]: Refreshing state... [id=0:W8nct6zGz]
module.dashboards.grafana_dashboard_permission.this["dashboards/kafka-exporter.json"]: Refreshing state... [id=0:CoYn_3-nk]
module.dashboards.grafana_dashboard_permission.this["dashboards/aws-subnet-usage.json"]: Refreshing state... [id=0:1NxY8ypGk]
module.dashboards.grafana_dashboard_permission.this["dashboards/flux-control-plane.json"]: Refreshing state... [id=0:flux-control-plane]
module.dashboards.grafana_dashboard_permission.this["dashboards/1password-metrics.json"]: Refreshing state... [id=0:1password_metrics_adoption]
module.dashboards.grafana_dashboard_permission.this["dashboards/1password-scimbridge.json"]: Refreshing state... [id=0:scimbridge_prod]
module.dashboards.grafana_dashboard_permission.this["dashboards/kiosk.json"]: Refreshing state... [id=0:b8e019c1-27b7-4e4b-b880-28da9911f046]
module.dashboards.grafana_dashboard_permission.this["dashboards/helm-exporter.json"]: Refreshing state... [id=0:Gqncyvfmz]
module.dashboards.grafana_dashboard_permission.this["dashboards/kubernetes-components.json"]: Refreshing state... [id=0:bj5-ZEhWk]
module.dashboards.grafana_dashboard_permission.this["dashboards/cluster-capacity.json"]: Refreshing state... [id=0:s_zMzas4z]
module.dashboards.grafana_dashboard_permission.this["dashboards/cluster-health.json"]: Refreshing state... [id=0:4IxKHWtMz]
module.dashboards.grafana_dashboard_permission.this["dashboards/selfservice-adoption.json"]: Refreshing state... [id=0:c9f3f4c0-454f-49df-90e3-93a13d25ce4b]
module.dashboards.grafana_dashboard_permission.this["dashboards/goldpinger.json"]: Refreshing state... [id=0:D4EyPQTWk]
module.dashboards.grafana_dashboard_permission.this["dashboards/cloud-engineering-adoption.json"]: Refreshing state... [id=0:axdphXDZz]
module.dashboards.grafana_dashboard_permission.this["dashboards/velero.json"]: Refreshing state... [id=0:YAniUGC]
module.dashboards.grafana_dashboard_permission.this["dashboards/ec2-credits.json"]: Refreshing state... [id=0:GUakfOpMk]
module.dashboards.grafana_dashboard_permission.this["dashboards/node-condition.json"]: Refreshing state... [id=0:KbpocXAVk]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # module.alerts.grafana_rule_group.alertrule["alertrules/API server 5xx errors alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - id                 = "0:c3fd8820-e5b7-d60f-de99-4d1231726eed:API server 5xx errors alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "API server 5xx errors alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "159"
              - "__dashboardUid__" = "4IxKHWtMz"
              - "__panelId__"      = "7"
              - "message"          = "Too many Kubernetes API requests returned  5xx errors in the last 5 minutes."
            } -> null
          - condition      = "A" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "cbeff883-8f55-4d33-8295-5f6e1b0e3fc8"
            } -> null
          - name           = "API server 5xx errors alert" -> null
          - no_data_state  = "OK" -> null
          - uid            = "ddp232omsetc0a" -> null

          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 25,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "B",
                                    ]
                                }
                              - reducer   = {
                                  - type = "avg"
                                }
                            },
                        ]
                      - refId      = "A"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - expr         = "(sum by (code) (code_resource:apiserver_request_total:rate5m{code=~\"5..\"}) / sum by (code) (code_resource:apiserver_request_total:rate5m)) * 100"
                      - interval     = ""
                      - legendFormat = "Rel {{code}}"
                      - refId        = "B"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 600 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Backup Validation Failure alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - id                 = "0:c3fd8820-e5b7-d60f-de99-4d1231726eed:Backup Validation Failure alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "Backup Validation Failure alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "181"
              - "__dashboardUid__" = "YAniUGC"
              - "__panelId__"      = "32"
              - "message"          = "Validation of a velero backup has failed.  Please use the Velero CLI to retrieve the logs to assist in investigation of the issue."
            } -> null
          - condition      = "B" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "d80bb8e3-3dd8-44ad-8357-572318f92b84"
            } -> null
          - name           = "Backup Validation Failure alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "cdp232nqkpx4wf" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - expr         = "rate(velero_backup_validation_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      - interval     = ""
                      - legendFormat = ""
                      - refId        = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 300 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.